[
	{
		"company": "Yext",
		"link": "https://www.yext.com/",
		"position": "Software Engineer Intern",
		"dates": "May 2024 — August 2024",
		"bullets": [
			"Enabled non-developers to create Yext Pages in seconds by building a visual editor in a team of eight with React and Go.",
			"Accelerated site initialization time by 95% through a gRPC endpoint in Go to automate repo provisioning and deployment.",
			"Streamlined development for 100+ API routes by architecting a scalable HTTP router for a new microservice in Go.",
			"Revitalized 63 React components in a distributed system by updating Java RPC endpoints for advanced entity filtering."

		],
		"skills": ["Go", "Java", "React", "TypeScript", "gRPC"]
	},
	{
		"company": "CargoLabs",
		"link": "https://cargolabs.org/",
		"position": "Software Engineer Intern",
		"dates": "June 2023 — August 2023",
		"bullets": [
			"Secured $30k in funding by leading development of an insurance claim analytics feature utilizing JavaScript and MySQL.",
			"Boosted frontend response time from 5.4s to 2.1s by optimizing MySQL query algorithms for filtering and pagination.",
			"Enhanced backend maintainability by refactoring 60,000+ lines of JavaScript into AWS Lambda serverless functions."

		],
		"skills": ["HTML", "CSS", "JavaScript", "AWS (Lambda, S3)"]
	},
	{
		"company": "University of Virginia",
		"link": "https://engineering.virginia.edu/departments/computer-science",
		"position": "Teaching Assistant",
		"dates": "August 2023 — Present",
		"bullets": [
			"Mentor 15 students each semester in building full-stack applications with Django, AWS S3, CI/CD, and RESTful APIs.",
			"Facilitate sprint planning and refinement workshops to enable student teams to excel in agile environments.",
			"Guide 400+ students during weekly office hours on object-oriented programming and Java testing frameworks.",
			"Simplify concepts such as OOP, TDD, REST, design patterns, and Git to strengthen practical software skills for students."

		],
		"skills": ["Python", "Java", "Django", "Heroku", "Postgres", "CI/CD"]
	},
	{
		"company": "UVA Biocomplexity",
		"link": "https://biocomplexity.virginia.edu/",
		"position": "Research Intern",
		"dates": "May 2022 — July 2022",
		"bullets": [
			"Refined data quality for a National Science Foundation project by developing Python scripts to clean and format data.",
			"Facilitated linear regression analysis by aggregating COVID-19 mobility data from 1.8 million U.S. locations.",
			"Led a presentation to over 120 faculty and interns at the UVA Biocomplexity Institute's annual research symposium."
		],
		"skills": ["Python", "NumPy", "Pandas", "PostgreSQL"]
	}
]
